restful-get.yml
# http://www.yamllint.com/ => validator
# $Env:DEBUG = 'http'

config:
  target: https://api.restful-api.dev/
  phases:
    - duration: 5
      arrivalRate: 5
      name: restful-api.dev all objects test
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}objects"